suculent/thinx-firmware-esp8266/thinx-firmware-esp8266-arduinoc-lib/thinx-lib-esp8266-arduinoc/src/thinx-lib-esp.h
#include <Arduino.h>
#define __DEBUG__
#define __DEBUG_JSON__

#define __USE_WIFI_MANAGER__

#include <stdio.h>
#include <Arduino.h>
#include "ArduinoJson/ArduinoJson.h"

#include "FS.h"

// Inject SSID and Password from 'Settings.h' for testing where we do not use EAVManager
#ifndef __USE_WIFI_MANAGER__
#include "Settings.h"
#else
// Custom clone of EAVManager (we shall revert back to OpenSource if this won't be needed)
// Purpose: SSID/password injection in AP mode
// Solution: re-implement from UDP in mobile application
//
// Changes so far: `int connectWifi()` moved to public section in header
// - buildable, but requires UDP end-to-end)
#include "EAVManager/EAVManager.h"
#include <EAVManager.h>
#endif

// Using better than Arduino-bundled version of MQTT https://github.com/Imroy/pubsubclient
#include "PubSubClient/PubSubClient.h" // Local checkout
//#include <PubSubClient.h> // Arduino Library

// WORK IN PROGRESS: Send a registration post request with current MAC, Firmware descriptor, commit ID; sha and version if known (with all other useful params like expected device owner).

// TODO: Add UDP AT&U= responder like in EAV? Considered unsafe. Device will notify available update and download/install it on its own (possibly throught THiNX Security Gateway (THiNX )
// IN PROGRESS: Add MQTT client (target IP defined using Thinx.h) and forced firmware update responder (will update on force or save in-memory state from new or retained mqtt notification)
// TODO: Add UDP responder AT&U only to update to next available firmware (from save in-memory state)

#include <ESP8266WiFi.h>
#include <ESP8266HTTPClient.h>
#include <ESP8266httpUpdate.h>

#define MQTT_BUFFER_SIZE 512

static const String thx_connected_response = "{ \"status\" : \"connected\" }";
static const String thx_disconnected_response = "{ \"status\" : \"disconnected\" }";

class THiNX {

  public:

    THiNX(String);
    THiNX();

    // WiFi Client
    EAVManager *manager;
    EAVManagerParameter *api_key_param;

    // THiNX Client
    String thinx_alias;
    String thinx_owner;
    String thinx_api_key;

    String thinx_udid;
    String thinx_commit_id;
    String thinx_firmware_version;
    String thinx_firmware_version_short;
    String thinx_cloud_url;
    String thinx_mqtt_url;
    int thinx_mqtt_port;

    void initWithAPIKey(String);

    // MQTT

    PubSubClient *mqtt_client;

    uint8_t buf[MQTT_BUFFER_SIZE];

    inline void mqtt_callback(const MQTT::Publish& pub) {
      if (pub.has_stream()) {
        Serial.print(pub.topic());
        Serial.print(" => ");
        if (pub.has_stream()) {

          int read;
          while (read = pub.payload_stream()->read(buf, MQTT_BUFFER_SIZE)) {
            // Do something with data in buffer
            Serial.write(buf, read);
          }
          pub.payload_stream()->stop();
          Serial.println("");
        } else {
          Serial.println(pub.payload_string());
        }
      }
    }

    private:

      // WiFi Manager
      WiFiClient *thx_wifi_client;
      const char* autoconf_ssid; // SSID in AP mode
      const char* autoconf_pwd; // fallback password, logged to console
      int status;                 // global WiFi status
      bool once;
      bool connected;
      void configModeCallback(EAVManager*);
      void saveConfigCallback();

      // THiNX API
      char thx_api_key[64];     // new firmware requires 64 bytes
      char thx_udid[64];        // new firmware requires 64 bytes
      StaticJsonBuffer<1024> jsonBuffer;

      void checkin();
      void senddata(String);
      void thinx_parse(String);
      void connect();
      void esp_update(String);

      // MQTT
      int last_mqtt_reconnect;
      void start_mqtt();
      String thinx_mqtt_channel();
      String thinx_mqtt_shared_channel();
      String thinx_mac();

      // Data Storage
      bool shouldSaveConfig;

      bool restoreDeviceInfo();
      void saveDeviceInfo();
      String deviceInfo();
};
